src/cf/Catalogs/Плагины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Плагины</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИдентификаторыОбъектовМетаданных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащитаОтОпасныхДействий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОткрытияФормы</Name>
					<Comment>0 - Независимый, 1 - Блокировать окно владельца , 2 - Блокировать весь интерфейс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлагина</Name>
					<Comment>0 -  Встроенная обработка, 1 -Внешняя  обработка, 2 - Алгоритм</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Плагины/Forms/ВыборПлагина/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗапуститьПлагин(Команда)
	ТекущиеДанные=Элементы.дзДанные.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда Возврат; КонецЕсли;
	ПараметыПлагина.Вставить("Плагин", ТекущиеДанные.Ссылка);
	ПлагиныКлиент.Открыть(ТекущиеДанные.Ссылка, ПараметыПлагина, ВладелецФормы);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция дзДанные_СоздатьВеткуДерева(РодительДерева, РодительПлагина, ВладелецПлагина)
	Выборка=Справочники.Плагины.Выбрать(РодительПлагина, ВладелецПлагина);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда Продолжить; КонецЕсли;

		Если Выборка.Доступ.Количество()>0 Тогда
			ДоступРазрешен=Ложь;
			Для каждого СтрокаКоллекции Из Выборка.Доступ Цикл
				Если СтрокаКоллекции.Пользователь.ЭтоГруппа Тогда
					Если ПараметрыСеанса.ТекущийПользователь.ПринадлежитЭлементу(СтрокаКоллекции.Пользователь) Тогда
						ДоступРазрешен=Истина; Прервать;
					КонецЕсли; 
				Иначе
					Если СтрокаКоллекции.Пользователь=ПараметрыСеанса.ТекущийПользователь Тогда
						ДоступРазрешен=Истина; Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;			
			Если НЕ ДоступРазрешен Тогда Продолжить; КонецЕсли; 
		КонецЕсли;

		НоваяСтрока=РодительДерева.Строки.Добавить();	
		НоваяСтрока.Ссылка=Выборка.Ссылка;
		НоваяСтрока.Картинка=БиблиотекаКартинок.Элемент;
		Если Выборка.ЭтоГруппа Тогда
			НоваяСтрока.Картинка=БиблиотекаКартинок.Группа;
			дзДанные_СоздатьВеткуДерева(НоваяСтрока, Выборка.Ссылка, ВладелецПлагина);
		КонецЕсли;
	КонецЦикла;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Владелец") Тогда
		Отказ=Истина; Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		Заголовок=СокрЛП(Параметры.Ссылка);
	Иначе
		Заголовок=СокрЛП(Параметры.Владелец);
	КонецЕсли; 
	
	//стрПолноеИмя=Параметры.Ссылка.Метаданные().ПолноеИмя();
	//Если Найти(стрПолноеИмя, "Документ.")>0 Тогда
	//	Заголовок="Плагины документа ("+СокрЛП(Параметры.Ссылка)+")";
	//Иначе
	//	Заголовок="Плагины элемента ("+СокрЛП(Параметры.Ссылка)+")";
	//КонецЕсли;		

	ПараметыПлагина=Новый Структура;
	ПараметыПлагина.Вставить("Ссылка", Параметры.Ссылка);
	
	дзСсылка=РеквизитФормыВЗначение("дзДанные");
	дзДанные_СоздатьВеткуДерева(дзСсылка, Справочники.Плагины.ПустаяСсылка(), Параметры.Владелец);
	ЗначениеВРеквизитФормы(дзСсылка, "дзДанные");
	
	ЕстьПлагины=дзСсылка.Строки.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЕстьПлагины Тогда
		Отказ=Истина; ПоказатьПредупреждение(, "Плагины не подключены!", 20);
	КонецЕсли; 	
КонецПроцедуры
